Revit 2024 API
DataConversionMonitorScope Class
 This class is used to regsiter an application-supplied object that implements IDataConversionMonitor. Creating the object registers an implementation of IDataConversionMonitor supplied as constructor argument. When the scope object is destroyed, that object is unregistered.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class DataConversionMonitorScope : IDisposable
Visual Basic
Public Class DataConversionMonitorScope _
	Implements IDisposable
Visual C++
public ref class DataConversionMonitorScope : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DataConversionMonitorScope
See Also
DataConversionMonitorScope Members
Autodesk.Revit.DB Namespace